dic1 = {
    'Jun': '6',
    'May': '5',
    'Apr': '4',
    'Mar': '3',
    'Feb': '2',
    'Jan': '1',
    'Dec': '12'
}

dic2 = {
    '01': '1',
    '02': '2',
    '03': '3',
    '04': '4',
    '05': '5',
    '06': '6',
    '07': '7',
    '08': '8',
    '09': '9',
    '10': '10',
    '11': '11',
    '12': '12',
    '13': '13',
    '14': '14',
    '15': '15',
    '16': '16',
    '17': '17',
    '18': '18',
    '19': '19',
    '20': '20',
    '21': '21',
    '22': '22',
    '23': '23',
    '24': '24',
    '25': '25',
    '26': '26',
    '27': '27',
    '28': '28',
    '29': '29',
    '30': '30',
    '31': '31',
}
strArr = ['共青团中央Id', '观察者网Id', '环球网Id', '健康中国Id', '每日经济新闻Id', '红星新闻Id', '南方周末Id', '澎湃新闻Id', '热点新闻Id', '人民网Id', '头条新闻Id',
          '新华视点Id', '新周刊Id', '央视新闻Id', '中国日报Id', '中国新闻网Id', '中国新闻周刊Id', '中国政府网Id', '中国之声Id', '紫光阁Id']
for i in strArr:
    filename = 'D:\数据\\' + i + '.csv'
    print(filename)
    cnt = open(filename, 'r')
    for line in cnt:
        s = line.strip().split(',')[2].split(' ')
        yue = dic1.get(s[1])
        ri = dic2.get(s[2])
        file = 'D:\微博数据\分类\\' + yue + '月' + ri + '日.csv'
        f = open(file=file, mode='a+', encoding='utf-8')
        f.write(line)
        f.close()
